{"events":[{"title":"終戦詔書","image":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Mamoru_Shigemitsu_signs_the_Instrument_of_Surrender%2C_officially_ending_the_Second_World_War.jpg/2560px-Mamoru_Shigemitsu_signs_the_Instrument_of_Surrender%2C_officially_ending_the_Second_World_War.jpg","date":"1945-08-15","description":"On the morning of August 6, 1945, at 8:15 a.m., the United States dropped an atomic bomb on Hiroshima, Japan. Sixteen hours later, U.S. President Harry S. Truman called on Japan to surrender again, warning of an \"unprecedented rain of aerial destruction.\" On the evening of August 8, the Soviet Union declared war on Japan in accordance with the Yalta Agreement, but in violation of the Soviet–Japanese Neutrality Pact, and invaded the Japanese puppet state of Manchukuo shortly after midnight on August 9. A few hours later, the United States dropped a second atomic bomb on Nagasaki. Emperor Hirohito ordered the Supreme Council for the Direction of the War to accept the terms outlined in the Potsdam Declaration. After several days of behind-the-scenes negotiations and an attempted coup, Emperor Hirohito addressed the nation on August 15, announcing Japan's surrender to the Allied forces.","id":"480e808f-e66b-4578-8a09-3f8f0dd753e8"},{"title":"Normandy Landings","image":"https://upload.wikimedia.org/wikipedia/commons/a/a5/Into_the_Jaws_of_Death_23-0455M_edit.jpg","date":"1944-06-06","description":"The Normandy Landings, codenamed Operation Neptune and commonly known as D-Day, took place in 1944 as a major Allied offensive on the Western Front of Europe during World War II, forming part of Operation Overlord. On June 6, 1944, 150,000 Allied troops crossed the English Channel and landed on the beaches of Normandy, France, in what remains the largest amphibious invasion in human history. The Normandy Landings initiated the liberation of France and Western Europe, laying the foundation for the Allied victory on the Western Front.","id":"3a7a0267-ed18-4482-b984-3f9325bafa10"},{"title":"Attack on Pearl Harbor","image":"https://www.twmemory.org/wp-content/uploads/2016/12/twmemory_011913.jpg","date":"1941-12-07","description":"The Attack on Pearl Harbor, also known as the Pearl Harbor Raid, was a surprise military strike by Japan against the United States naval base at Pearl Harbor in Hawaii on December 7, 1941. The attack marked the beginning of the Pacific War and served as a major turning point in World War II.","id":"1930ff0b-ecbe-4a6c-80b6-ecad851fc6b3"},{"title":"The Blitz","image":"https://upload.wikimedia.org/wikipedia/commons/c/c1/Surreydocks1941.jpg","date":"1940-09-07","description":"The Blitz refers to the strategic bombing campaign carried out by Nazi Germany against the British capital, London, during World War II. The bombings took place between September 7, 1940, and May 10, 1941, targeting cities and industrial centers across the United Kingdom, with London suffering the most severe damage. By the end of the Battle of Britain, London had been bombed for more than 76 consecutive nights, resulting in over 43,000 civilian deaths and the destruction of approximately 100,000 homes, making it one of the most heavily bombed cities of the war.","id":"00d192c2-2353-4e26-af6f-f378787648bc"},{"title":"Kampania wrześniowa","image":"https://img.ltn.com.tw/Upload/news/600/2022/09/01/phpyhASub.jpg","date":"1939-09-01","description":"The Invasion of Poland, also known as the September Campaign, was a joint military action by Germany, Slovakia, and the Soviet Union in September 1939. It is generally regarded as the beginning of World War II. One week after signing the German–Soviet Non-Aggression Pact, Germany launched its attack on September 1, 1939, at 4:40 a.m., and the Soviet Union invaded Poland on September 17. By October 6, German and Soviet forces had largely occupied the entire country and divided Poland according to the supplementary protocol of the German–Soviet Boundary and Friendship Treaty, marking the end of the campaign.","id":"20bed82e-00e9-4e09-9eca-e3b35c8a28cc"},{"title":"Munich Putsch","image":"https://cdn.britannica.com/58/129958-050-C0EF01A4/Adolf-Hitler-1933.jpg","date":"1923-11-08","description":"The Beer Hall Putsch (German: Bürgerbräu-Putsch), also known as the Beer Hall Revolt, refers to a failed coup attempt carried out on the evening of November 8, 1923, by the Nazi Party in Munich at the Bürgerbräukeller beer hall. The plot aimed to overthrow the Weimar Republic by emulating Benito Mussolini’s earlier March on Rome, but ultimately ended in failure.\n\nThe main organizers included Nazi Party leader Adolf Hitler, World War I German general Erich Ludendorff, and other members of the Kampfbund, a coalition consisting of the Nazi Party, the Sturmabteilung (SA), the Freikorps Oberland, and the Reichskriegsflagge organization. Their primary objective was to dismantle Germany’s parliamentary democratic system and establish a dictatorship based on National Socialism.","id":"526ae3b7-fe28-463d-8788-4fd343b663d8"}]}